crosstab
pivot_table

In [27]:
import pandas as pd

In [34]:
data = {'Gender': ['Male', 'Female', 'Male', 'Female', 'Male'],
            'Smoker': ['Yes', 'No', 'Yes', 'No', 'No']}
df = pd.DataFrame(data)

cross_tab = pd.crosstab(df['Gender'], df['Smoker'])
cross_tab

Smoker  No  Yes
Gender
Female   2    0
Male     1    2

In [38]:
data = {'Education': ['High School', 'College', 'High School', 'College'],
        'Employment': ['Employed', 'Employed', 'Unemployed', 'Unemployed']}
df = pd.DataFrame(data)

cross_tab_with_margins = pd.crosstab(df['Education'], df['Employment'], margins=True, margins_name='Total')
cross_tab_with_margins

Employment   Employed  Unemployed  Total
Education
College             1           1      2
High School         1           1      2
Total               2           2      4

In [48]:
data = {'City': ['New York', 'London', 'New York', 'Paris', 'London'],
            'Product': ['A', 'B', 'A', 'C', 'B'],
            'Sales': [100, 150, 120, 80, 200]}
df = pd.DataFrame(data)

sales_by_city_product = pd.crosstab(df['City'], df['Product'], values=df['Sales'], aggfunc='sum')
sales_by_city_product

Product       A      B     C
City
London      NaN  350.0   NaN
New York  220.0    NaN   NaN
Paris       NaN    NaN  80.0

How to fetch only non null values from above result?

In [53]:
sales_by_city_product.values
~pd.isna(sales_by_city_product)
sales_by_city_product.values[~pd.isna(sales_by_city_product)].tolist()

[350.0, 220.0, 80.0]

In [54]:
data = {'City': ['New York', 'London', 'New York', 'Paris', 'London'],
            'Product': ['A', 'B', 'A', 'C', 'B'],
            'Sales': [100, 150, 120, 80, 200]}
df = pd.DataFrame(data)
pd.crosstab(df['City'], df['Product'], margins=True, margins_name='Total')

Product   A  B  C  Total
City
London    0  2  0      2
New York  2  0  0      2
Paris     0  0  1      1
Total     2  2  1      5

In [56]:
data = {'Gender': ['Male', 'Female', 'Male', 'Female', 'Male'],
        'Smoker': ['Yes', 'No', 'Yes', 'No', 'No']}
df = pd.DataFrame(data)
df

   Gender Smoker
0    Male    Yes
1  Female     No
2    Male    Yes
3  Female     No
4    Male     No

In [58]:
pd.crosstab(df['Gender'], df['Smoker'])

Smoker  No  Yes
Gender
Female   2    0
Male     1    2

In [59]:
normalized_cross_tab = pd.crosstab(df['Gender'], df['Smoker'], normalize='index')
normalized_cross_tab

Smoker        No       Yes
Gender
Female  1.000000  0.000000
Male    0.333333  0.666667

In [60]:
normalized_cross_tab = pd.crosstab(df['Gender'], df['Smoker'], normalize='columns')
normalized_cross_tab

Smoker        No  Yes
Gender
Female  0.666667  0.0
Male    0.333333  1.0

In [61]:
data = {
  "Name": ["Alice", "Bob", "Charlie", "David", "Eva", "Frank", "Grace"],
  "Gender": ["F", "M", "M", "M", "F", "M", "F"],
  "Department": ["HR", "Engineering", "HR", "Engineering", "Marketing", "HR", "Marketing"],
  "Tenure": [2, 5, 3, 2, 4, 5, 2]
}

In [62]:
df = pd.DataFrame(data)
df

      Name Gender   Department  Tenure
0    Alice      F           HR       2
1      Bob      M  Engineering       5
2  Charlie      M           HR       3
3    David      M  Engineering       2
4      Eva      F    Marketing       4
5    Frank      M           HR       5
6    Grace      F    Marketing       2

In [63]:
pd.crosstab(df['Gender'], df['Department'])

Department  Engineering  HR  Marketing
Gender
F                     0   1          2
M                     2   2          0

In [64]:
pd.crosstab(df['Gender'], df['Department'], normalize='columns')

Department  Engineering        HR  Marketing
Gender
F                   0.0  0.333333        1.0
M                   1.0  0.666667        0.0

In [65]:
pd.crosstab(df['Gender'], df['Department'], normalize='index')

Department  Engineering        HR  Marketing
Gender
F                   0.0  0.333333   0.666667
M                   0.5  0.500000   0.000000

#### Docs

In [ ]:
import numpy as np

a = np.array(["foo", "foo", "foo", "foo", "bar", "bar",
              "bar", "bar", "foo", "foo", "foo"], dtype=object)
b = np.array(["one", "one", "one", "two", "one", "one",
              "one", "two", "two", "two", "one"], dtype=object)
c = np.array(["dull", "dull", "shiny", "dull", "dull", "shiny",
              "shiny", "dull", "shiny", "shiny", "shiny"],
             dtype=object)

In [ ]:
pd.crosstab(a,b)

In [ ]:
pd.crosstab(a, b, rownames=['aaa'], colnames=['bbb'])

In [ ]:
pd.crosstab(a, [b, c], rownames=['a'], colnames=['b', 'c'])

## Pivot

In [67]:
data = {'Date': ['2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02'],
        'City': ['NY', 'LA', 'NY', 'LA'],
        'Temperature': [55, 72, 53, 75]}

In [68]:
df = pd.DataFrame(data)
df

         Date City  Temperature
0  2023-01-01   NY           55
1  2023-01-01   LA           72
2  2023-01-02   NY           53
3  2023-01-02   LA           75

In [69]:
df.pivot(columns='City', index='Date', values='Temperature')

City        LA  NY
Date
2023-01-01  72  55
2023-01-02  75  53

In [70]:
data = {
    'Date': ['2023-01-01', '2023-01-01', '2023-01-01', '2023-01-02', '2023-01-03'],
    'City': ['New York', 'Los Angeles', 'New York', 'Los Angeles', 'New York'],
    'Temperature': [32, 75, 10, 77, 35],
    'Humidity': [80, 60, 85, 55, 78]
}
df = pd.DataFrame(data)
df

         Date         City  Temperature  Humidity
0  2023-01-01     New York           32        80
1  2023-01-01  Los Angeles           75        60
2  2023-01-01     New York           10        85
3  2023-01-02  Los Angeles           77        55
4  2023-01-03     New York           35        78

In [71]:
df.pivot_table(index='Date', columns='City', values='Temperature', aggfunc='mean')

City        Los Angeles  New York
Date
2023-01-01         75.0      21.0
2023-01-02         77.0       NaN
2023-01-03          NaN      35.0

In [72]:
data = {
   "value": range(12),
   "variable": ["A"] * 3 + ["B"] * 3 + ["C"] * 3 + ["D"] * 3,
   "date": pd.to_datetime(["2020-01-03", "2020-01-04", "2020-01-05"] * 4)
}
df = pd.DataFrame(data)
df

    value variable       date
0       0        A 2020-01-03
1       1        A 2020-01-04
2       2        A 2020-01-05
3       3        B 2020-01-03
4       4        B 2020-01-04
5       5        B 2020-01-05
6       6        C 2020-01-03
7       7        C 2020-01-04
8       8        C 2020-01-05
9       9        D 2020-01-03
10     10        D 2020-01-04
11     11        D 2020-01-05

In [73]:
df.pivot(index= 'date', columns='variable', values='value')

variable    A  B  C   D
date
2020-01-03  0  3  6   9
2020-01-04  1  4  7  10
2020-01-05  2  5  8  11

In [ ]:
df.pivot(index= 'date', columns='variable', values='value')